app/controllers/api/cupping_sessions_controller.rb

    def show
      @cupping_session = CuppingSession.includes(:samples).find(params[:id])
---
SELECT  "cupping_sessions".* FROM "cupping_sessions" WHERE "cupping_sessions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "samples".* FROM "samples" WHERE "samples"."cupping_session_id" = 2

    def index
      @cupping_sessions =
        CuppingSession.all
          .includes(:samples)
---
SELECT "cupping_sessions".* FROM "cupping_sessions"
SELECT "samples".* FROM "samples" WHERE "samples"."cupping_session_id" = 2