app/controllers/api/samples_controller.rb

SELECT  "samples".* FROM "samples" WHERE "samples"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @sample = Sample.find(params[:id])

SELECT "samples".* FROM "samples"
---
    def index
      @samples = Sample.all