app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "cupping_sessions".* FROM "cupping_sessions" WHERE "cupping_sessions"."user_id" = 7
---
    def show
      # 5/14 is this correct?
      @user = User.includes(:cupping_sessions).find(params[:id])